package com.example.demo1.recyclerviewwithtangrams.entity;

public class JsonData {
    public static final String EAT = "[{\"title\":\"澄阳湖大闸蟹\",\"content\":\"10月12号看《新闻联播》了吗？马鞍山当涂大闸蟹“爬”到央视《新闻联播》头条了。据《当涂县志》载：“当涂境内水…\"},{\"title\":\"当涂大肉面\",\"content\":\"当涂大肉面，又称205大肉面，在20世纪90年代中期起源于205国道当涂段，客人主要是路上跑车人。汁浓味醇的大…\"},{\"title\":\"薛津馄饨\",\"content\":\"薛津馄饨，2014年经央视《消费主张》报道后，迅速火了！紧接着央视4套、9套、10套分别进行了报道。薛津馄饨位…\"},{\"title\":\"黄池金菜地副食品\",\"content\":\"每座城市都有自己的特色小吃，品种丰富的小吃诱惑着每一位路人，朴…\"},{\"title\":\"含山老鹅汤\",\"content\":\"9月30号上午，2017第三届含山老鹅汤美食节开幕式在铜闸镇美食村广…\"},{\"title\":\"和县香泉羊肉面\",\"content\":\"没吃过羊肉面，就算没到过香泉，和县香泉是一个因温泉而饮誉八方的…\"},{\"title\":\"澄阳湖大闸蟹\",\"content\":\"10月12号看《新闻联播》了吗？马鞍山当涂大闸蟹“爬”到央视《新闻联播》头条了。据《当涂县志》载：“当涂境内水…\"},{\"title\":\"澄阳湖大闸蟹\",\"content\":\"10月12号看《新闻联播》了吗？马鞍山当涂大闸蟹“爬”到央视《新闻联播》头条了。据《当涂县志》载：“当涂境内水…\"}]";
}
