package com.example.coolweather;

/**
 * Created by admin on 2018/8/13.
 * 说明文档
 * 需求：编写一个完整的天气预报程序，名为“酷欧天气”
 */

public class Constants {

    /*
    * 1.需求分析（应该具备的基础功能）：
    *   1）可以罗列出全国所有的省、市、县；
    *   2）可以查看全国任意城市的天气信息；
    *   3）可以自由切换城市，去查看其他城市的天气；
    *   4）提供手动更新以及后台自动更新天气的功能。
    *
    *  2.需要用到的技术：UI，网络，数据存储，服务等技术。
    *
    *  3.技术可行性分析
    *   1）如何获取全国省市县的数据信息？
    *   2）如何获取每个城市的天气信息？
    *
    *  4.和风天气提供天气预报数据来源 ； 架设一台服务器提供全国所有省市县的数据信息。
    *   1）全国所有的省份，访问：http://guolin.tech/api/china
    *   json数据：[{"id":1,"name":"北京"},{"id":2,"name":"上海"}]
    *   2）某个省内的哪些城市，访问：http://guolin.tech/api/china/16
    *
    * */

}
